hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_800k_200k_spr-hbm-flat/0/walls/PotE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      PotESolid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            zeroGradient;
    }

    topWall
    {
        type            coupledPotential;
        value           uniform 0;
    }

    botWall
    {
        type            coupledPotential;
        value           uniform 0;
    }

    leftAndRight
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
