hunt/baseCase/basecase_mhdEpotMultiRegionFoam_Ha20_strongScaling_800k_200k_spr-hbm-flat/system/walls/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{   
    PotE
    {
        solver           FPCG;
        preconditioner   DIC;
        tolerance        1e-6;
        relTol           0.05;
    }
    
    PotEFinal
    {
        $PotE;
        relTol           0;  
    }    
}

PIMPLE
{
}

// ************************************************************************* //
